ranjithaguna/pv/LED_Demo/source/pic32cx/component/vci.h
/**
 * \brief Component description for PIC32CX/0525SG12 VCI
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_VCI_COMPONENT_H_
#define _PIC32CX_0525SG12_VCI_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_VCI The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR VCI */
/* ========================================================================== */

/* -------- VCI_REG : (VCI Offset: 0x00) (R/W 32) VCI Register -------- */

typedef union
{
  struct
  {
    uint32_t VCI_IN:4;                  /**< bit:   0..3  These bits provide the latched state of the associated VCI_IN# pin, if latching is enabled or the current state of the pin\n     if latching is not enabled. In both cases, the value is determined after the action of the VCI Polarity Register.\n     Note: The VCI_IN[6:0]# bits default to the state of their respective input pins. */
    uint32_t :3;                        /**< bit:   4..6  Reserved                                      */
    uint32_t VCI_OUT_GPIO_SEL:1;        /**< bit:      7  This bit selects the power source for GPIO outputs.\n    1= GPIO will be powered by VBAT power well (VCI_OUT functionality).\n    0= GPIO will be powered by VTR power well.\n */
    uint32_t VCI_OVRD_IN:1;             /**< bit:      8  This bit provides the current status of the VCI_OVRD_IN pin.\n     Note: The VCI_OVRD_IN bit defaults to the state of the respective input pin. */
    uint32_t VCI_OUT:1;                 /**< bit:      9  This bit provides the current status of the VCI_OUT pin. */
    uint32_t VCI_FW_CNTRL:1;            /**< bit:     10  This bit can allow EC firmware to control the state of the VCI_OUT pin. For example, when VTR_PWRGD is asserted and the\n     FW_EXT bit is 1, clearing the VCI_FW_CNTRL bit de-asserts the active high VCI_OUT pin. BIOS must set this bit to 1 prior to setting\n     the FW_EXT bit to 1 on power up, in order to avoid glitches on the VCI_OUT pin. */
    uint32_t FW_EXT:1;                  /**< bit:     11  This bit controls selecting between the external VBAT-Powered Control Interface inputs, or the VCI_FW_CNTRL bit output to control the VCI_OUT pin.\n     1=VCI_OUT is determined by the VCI_FW_CNTRL field, when VTR is active\n     0=VCI_OUT is determined by the external inputs.\n     Note: This bit used to be called GPO/nEXT. The name was changed to distinguish it from the BGPOs, which are elsewhere, and to remove a / in a bit name. */
    uint32_t FILTERS_BYPASS:1;          /**< bit:     12  The Filters Bypass bit is used to enable and disable the input filters on the VCI_IN# pins.\n     1=Filters disabled; 0=Filters enabled (default). */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t WEEK_ALRM:1;               /**< bit:     16  If enabled by WEEK_ALRM_LE, this bit is set to 1 if the Week Alarm signal is asserted. It is reset by writes to WEEK_ALRM_LS. */
    uint32_t RTC_ALRM:1;                /**< bit:     17  If enabled by RTC_ALRM_LE, this bit is set to 1 if the RTC Alarm signal is asserted. It is reset by writes to RTC_ALRM_LS. */
    uint32_t VCI_IN3_SYSPWR_PRES_SEL:1;  /**< bit:     18  This is the System power present select bit.\n    1= VCI_IN3 is used as System power present.\n    0= VCI_IN3 is used as VCI_IN3.\n */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_REG_bits_t;
#define VCI_REG_RESETVALUE                  (0x80U)                                       /**<  (VCI_REG) VCI Register  Reset Value */

#define VCI_REG_VCI_IN_Pos                    (0)                                            /**< (VCI_REG) These bits provide the latched state of the associated VCI_IN# pin, if latching is enabled or the current state of the pin\n     if latching is not enabled. In both cases, the value is determined after the action of the VCI Polarity Register.\n     Note: The VCI_IN[6:0]# bits default to the state of their respective input pins. Position */
#define VCI_REG_VCI_IN_Msk                    (0xFU << VCI_REG_VCI_IN_Pos)                   /**< (VCI_REG) These bits provide the latched state of the associated VCI_IN# pin, if latching is enabled or the current state of the pin\n     if latching is not enabled. In both cases, the value is determined after the action of the VCI Polarity Register.\n     Note: The VCI_IN[6:0]# bits default to the state of their respective input pins. Mask */
#define VCI_REG_VCI_IN(value)                 (VCI_REG_VCI_IN_Msk & ((value) << VCI_REG_VCI_IN_Pos))
#define VCI_REG_VCI_OUT_GPIO_SEL_Pos          (7)                                            /**< (VCI_REG) This bit selects the power source for GPIO outputs.\n    1= GPIO will be powered by VBAT power well (VCI_OUT functionality).\n    0= GPIO will be powered by VTR power well.\n Position */
#define VCI_REG_VCI_OUT_GPIO_SEL_Msk          (0x1U << VCI_REG_VCI_OUT_GPIO_SEL_Pos)         /**< (VCI_REG) This bit selects the power source for GPIO outputs.\n    1= GPIO will be powered by VBAT power well (VCI_OUT functionality).\n    0= GPIO will be powered by VTR power well.\n Mask */
#define VCI_REG_VCI_OVRD_IN_Pos               (8)                                            /**< (VCI_REG) This bit provides the current status of the VCI_OVRD_IN pin.\n     Note: The VCI_OVRD_IN bit defaults to the state of the respective input pin. Position */
#define VCI_REG_VCI_OVRD_IN_Msk               (0x1U << VCI_REG_VCI_OVRD_IN_Pos)              /**< (VCI_REG) This bit provides the current status of the VCI_OVRD_IN pin.\n     Note: The VCI_OVRD_IN bit defaults to the state of the respective input pin. Mask */
#define VCI_REG_VCI_OUT_Pos                   (9)                                            /**< (VCI_REG) This bit provides the current status of the VCI_OUT pin. Position */
#define VCI_REG_VCI_OUT_Msk                   (0x1U << VCI_REG_VCI_OUT_Pos)                  /**< (VCI_REG) This bit provides the current status of the VCI_OUT pin. Mask */
#define VCI_REG_VCI_FW_CNTRL_Pos              (10)                                           /**< (VCI_REG) This bit can allow EC firmware to control the state of the VCI_OUT pin. For example, when VTR_PWRGD is asserted and the\n     FW_EXT bit is 1, clearing the VCI_FW_CNTRL bit de-asserts the active high VCI_OUT pin. BIOS must set this bit to 1 prior to setting\n     the FW_EXT bit to 1 on power up, in order to avoid glitches on the VCI_OUT pin. Position */
#define VCI_REG_VCI_FW_CNTRL_Msk              (0x1U << VCI_REG_VCI_FW_CNTRL_Pos)             /**< (VCI_REG) This bit can allow EC firmware to control the state of the VCI_OUT pin. For example, when VTR_PWRGD is asserted and the\n     FW_EXT bit is 1, clearing the VCI_FW_CNTRL bit de-asserts the active high VCI_OUT pin. BIOS must set this bit to 1 prior to setting\n     the FW_EXT bit to 1 on power up, in order to avoid glitches on the VCI_OUT pin. Mask */
#define VCI_REG_FW_EXT_Pos                    (11)                                           /**< (VCI_REG) This bit controls selecting between the external VBAT-Powered Control Interface inputs, or the VCI_FW_CNTRL bit output to control the VCI_OUT pin.\n     1=VCI_OUT is determined by the VCI_FW_CNTRL field, when VTR is active\n     0=VCI_OUT is determined by the external inputs.\n     Note: This bit used to be called GPO/nEXT. The name was changed to distinguish it from the BGPOs, which are elsewhere, and to remove a / in a bit name. Position */
#define VCI_REG_FW_EXT_Msk                    (0x1U << VCI_REG_FW_EXT_Pos)                   /**< (VCI_REG) This bit controls selecting between the external VBAT-Powered Control Interface inputs, or the VCI_FW_CNTRL bit output to control the VCI_OUT pin.\n     1=VCI_OUT is determined by the VCI_FW_CNTRL field, when VTR is active\n     0=VCI_OUT is determined by the external inputs.\n     Note: This bit used to be called GPO/nEXT. The name was changed to distinguish it from the BGPOs, which are elsewhere, and to remove a / in a bit name. Mask */
#define VCI_REG_FILTERS_BYPASS_Pos            (12)                                           /**< (VCI_REG) The Filters Bypass bit is used to enable and disable the input filters on the VCI_IN# pins.\n     1=Filters disabled; 0=Filters enabled (default). Position */
#define VCI_REG_FILTERS_BYPASS_Msk            (0x1U << VCI_REG_FILTERS_BYPASS_Pos)           /**< (VCI_REG) The Filters Bypass bit is used to enable and disable the input filters on the VCI_IN# pins.\n     1=Filters disabled; 0=Filters enabled (default). Mask */
#define VCI_REG_WEEK_ALRM_Pos                 (16)                                           /**< (VCI_REG) If enabled by WEEK_ALRM_LE, this bit is set to 1 if the Week Alarm signal is asserted. It is reset by writes to WEEK_ALRM_LS. Position */
#define VCI_REG_WEEK_ALRM_Msk                 (0x1U << VCI_REG_WEEK_ALRM_Pos)                /**< (VCI_REG) If enabled by WEEK_ALRM_LE, this bit is set to 1 if the Week Alarm signal is asserted. It is reset by writes to WEEK_ALRM_LS. Mask */
#define VCI_REG_RTC_ALRM_Pos                  (17)                                           /**< (VCI_REG) If enabled by RTC_ALRM_LE, this bit is set to 1 if the RTC Alarm signal is asserted. It is reset by writes to RTC_ALRM_LS. Position */
#define VCI_REG_RTC_ALRM_Msk                  (0x1U << VCI_REG_RTC_ALRM_Pos)                 /**< (VCI_REG) If enabled by RTC_ALRM_LE, this bit is set to 1 if the RTC Alarm signal is asserted. It is reset by writes to RTC_ALRM_LS. Mask */
#define VCI_REG_VCI_IN3_SYSPWR_PRES_SEL_Pos   (18)                                           /**< (VCI_REG) This is the System power present select bit.\n    1= VCI_IN3 is used as System power present.\n    0= VCI_IN3 is used as VCI_IN3.\n Position */
#define VCI_REG_VCI_IN3_SYSPWR_PRES_SEL_Msk   (0x1U << VCI_REG_VCI_IN3_SYSPWR_PRES_SEL_Pos)  /**< (VCI_REG) This is the System power present select bit.\n    1= VCI_IN3 is used as System power present.\n    0= VCI_IN3 is used as VCI_IN3.\n Mask */
#define VCI_REG_Msk                           (0x00071F8FUL)                                 /**< (VCI_REG) Register Mask  */

/* -------- VCI_LATCH_ENABLE : (VCI Offset: 0x04) (R/W 32) Latch Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t LE:4;                      /**< bit:   0..3  Latching Enables. Latching occurs after the Polarity configuration, so a VCI_INi# pin is asserted when it is '0' if VCI_IN_POL is '0', and asserted when it is '1' if VCI_IN_POL is '1'.\n     For each bit in the field:\n     1=Enabled. Assertions of the VCI_INi# pin are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The VCI_INi# signal is not latched but passed directly to the VCI_OUT logic */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t WEEK_ALRM_LE:1;            /**< bit:     16  Latch enable for the Week Alarm Power-Up signal.\n     1=Enabled. Assertions of the Week Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The Week Alarm signal is not latched but passed directly to the VCI_OUT logic */
    uint32_t RTC_ALRM_LE:1;             /**< bit:     17  Latch enable for the RTC Power-Up signal.\n     1=Enabled. Assertions of the RTC Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The RTC Alarm signal is not latched but passed directly to the VCI_OUT logic */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_LATCH_ENABLE_bits_t;
#define VCI_LATCH_ENABLE_RESETVALUE         (0x00U)                                       /**<  (VCI_LATCH_ENABLE) Latch Enable Register  Reset Value */

