ranjithaguna/pv/LED_Demo/source/pic32cx/component/vci.h
#define VCI_LATCH_ENABLE_LE_Pos               (0)                                            /**< (VCI_LATCH_ENABLE) Latching Enables. Latching occurs after the Polarity configuration, so a VCI_INi# pin is asserted when it is '0' if VCI_IN_POL is '0', and asserted when it is '1' if VCI_IN_POL is '1'.\n     For each bit in the field:\n     1=Enabled. Assertions of the VCI_INi# pin are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The VCI_INi# signal is not latched but passed directly to the VCI_OUT logic Position */
#define VCI_LATCH_ENABLE_LE_Msk               (0xFU << VCI_LATCH_ENABLE_LE_Pos)              /**< (VCI_LATCH_ENABLE) Latching Enables. Latching occurs after the Polarity configuration, so a VCI_INi# pin is asserted when it is '0' if VCI_IN_POL is '0', and asserted when it is '1' if VCI_IN_POL is '1'.\n     For each bit in the field:\n     1=Enabled. Assertions of the VCI_INi# pin are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The VCI_INi# signal is not latched but passed directly to the VCI_OUT logic Mask */
#define VCI_LATCH_ENABLE_LE(value)            (VCI_LATCH_ENABLE_LE_Msk & ((value) << VCI_LATCH_ENABLE_LE_Pos))
#define VCI_LATCH_ENABLE_WEEK_ALRM_LE_Pos     (16)                                           /**< (VCI_LATCH_ENABLE) Latch enable for the Week Alarm Power-Up signal.\n     1=Enabled. Assertions of the Week Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The Week Alarm signal is not latched but passed directly to the VCI_OUT logic Position */
#define VCI_LATCH_ENABLE_WEEK_ALRM_LE_Msk     (0x1U << VCI_LATCH_ENABLE_WEEK_ALRM_LE_Pos)    /**< (VCI_LATCH_ENABLE) Latch enable for the Week Alarm Power-Up signal.\n     1=Enabled. Assertions of the Week Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The Week Alarm signal is not latched but passed directly to the VCI_OUT logic Mask */
#define VCI_LATCH_ENABLE_RTC_ALRM_LE_Pos      (17)                                           /**< (VCI_LATCH_ENABLE) Latch enable for the RTC Power-Up signal.\n     1=Enabled. Assertions of the RTC Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The RTC Alarm signal is not latched but passed directly to the VCI_OUT logic Position */
#define VCI_LATCH_ENABLE_RTC_ALRM_LE_Msk      (0x1U << VCI_LATCH_ENABLE_RTC_ALRM_LE_Pos)     /**< (VCI_LATCH_ENABLE) Latch enable for the RTC Power-Up signal.\n     1=Enabled. Assertions of the RTC Alarm are held until the latch is reset by writing the corresponding LS bit\n     0=Not Enabled. The RTC Alarm signal is not latched but passed directly to the VCI_OUT logic Mask */
#define VCI_LATCH_ENABLE_Msk                  (0x0003000FUL)                                 /**< (VCI_LATCH_ENABLE) Register Mask  */

/* -------- VCI_LATCH_RESETS : (VCI Offset: 0x08) (R/W 32) Latch Resets Register -------- */

typedef union
{
  struct
  {
    uint32_t LS:4;                      /**< bit:   0..3  Latch Resets. When a Latch Resets bit is written with a '1', the corresponding VCI_INi# latch is de-asserted ('1'). The VCI_INi#\n     input to the latch has priority over the Latch Reset input, so firmware cannot reset the latch while the VCI_INi# pin is asserted. Firmware\n     should sample the state of the pin in the VCI Register before attempting to reset the latch. As noted in the Latch Enable Register,\n     the assertion level is determined by the VCI_IN_POL bit. Reads of this register are undefined. */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t WEEK_ALRM_LS:1;            /**< bit:     16  Week Alarm Latch Reset. When this bit is written with a '1', the Week Alarm Event latch is reset.\n     The Week Alarm input to the latch has priority over the Reset input Reads of this register are undefined. */
    uint32_t RTC_ALRM_LS:1;             /**< bit:     17  RTC Alarm Latch Reset. When this bit is written with a '1', the RTC Alarm Event latch is reset.\n     The RTC Alarm input to the latch has priority over the Reset input Reads of this register are undefined. */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_LATCH_RESETS_bits_t;
#define VCI_LATCH_RESETS_RESETVALUE         (0x00U)                                       /**<  (VCI_LATCH_RESETS) Latch Resets Register  Reset Value */

#define VCI_LATCH_RESETS_LS_Pos               (0)                                            /**< (VCI_LATCH_RESETS) Latch Resets. When a Latch Resets bit is written with a '1', the corresponding VCI_INi# latch is de-asserted ('1'). The VCI_INi#\n     input to the latch has priority over the Latch Reset input, so firmware cannot reset the latch while the VCI_INi# pin is asserted. Firmware\n     should sample the state of the pin in the VCI Register before attempting to reset the latch. As noted in the Latch Enable Register,\n     the assertion level is determined by the VCI_IN_POL bit. Reads of this register are undefined. Position */
#define VCI_LATCH_RESETS_LS_Msk               (0xFU << VCI_LATCH_RESETS_LS_Pos)              /**< (VCI_LATCH_RESETS) Latch Resets. When a Latch Resets bit is written with a '1', the corresponding VCI_INi# latch is de-asserted ('1'). The VCI_INi#\n     input to the latch has priority over the Latch Reset input, so firmware cannot reset the latch while the VCI_INi# pin is asserted. Firmware\n     should sample the state of the pin in the VCI Register before attempting to reset the latch. As noted in the Latch Enable Register,\n     the assertion level is determined by the VCI_IN_POL bit. Reads of this register are undefined. Mask */
#define VCI_LATCH_RESETS_LS(value)            (VCI_LATCH_RESETS_LS_Msk & ((value) << VCI_LATCH_RESETS_LS_Pos))
#define VCI_LATCH_RESETS_WEEK_ALRM_LS_Pos     (16)                                           /**< (VCI_LATCH_RESETS) Week Alarm Latch Reset. When this bit is written with a '1', the Week Alarm Event latch is reset.\n     The Week Alarm input to the latch has priority over the Reset input Reads of this register are undefined. Position */
#define VCI_LATCH_RESETS_WEEK_ALRM_LS_Msk     (0x1U << VCI_LATCH_RESETS_WEEK_ALRM_LS_Pos)    /**< (VCI_LATCH_RESETS) Week Alarm Latch Reset. When this bit is written with a '1', the Week Alarm Event latch is reset.\n     The Week Alarm input to the latch has priority over the Reset input Reads of this register are undefined. Mask */
#define VCI_LATCH_RESETS_RTC_ALRM_LS_Pos      (17)                                           /**< (VCI_LATCH_RESETS) RTC Alarm Latch Reset. When this bit is written with a '1', the RTC Alarm Event latch is reset.\n     The RTC Alarm input to the latch has priority over the Reset input Reads of this register are undefined. Position */
#define VCI_LATCH_RESETS_RTC_ALRM_LS_Msk      (0x1U << VCI_LATCH_RESETS_RTC_ALRM_LS_Pos)     /**< (VCI_LATCH_RESETS) RTC Alarm Latch Reset. When this bit is written with a '1', the RTC Alarm Event latch is reset.\n     The RTC Alarm input to the latch has priority over the Reset input Reads of this register are undefined. Mask */
#define VCI_LATCH_RESETS_Msk                  (0x0003000FUL)                                 /**< (VCI_LATCH_RESETS) Register Mask  */

/* -------- VCI_INPUT_ENABLE : (VCI Offset: 0x0c) (R/W 32) VCI Input Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t IE:4;                      /**< bit:   0..3  Input Enables for VCI_IN# signals. After changing the input enable for a VCI input, firmware should reset the input latch and clear\n     any potential interrupt that may have been triggered by the input, as changing the enable may cause the internal status to change.\n     For each bit in the field:\n     1=Enabled. The corresponding VCI_IN# input is not gated and toggling the pin will affect the VCI_OUT pin\n     0=Not Enabled. the corresponding VCI_IN# input does not affect the VCI_OUT pin, even if the input is '0'. Unless the corresponding bit\n     in the VCI Buffer Enable Register is 1, latches are not asserted, even if the VCI_IN# pin is low, during a VBAT power transition */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_INPUT_ENABLE_bits_t;
#define VCI_INPUT_ENABLE_RESETVALUE         (0x07U)                                       /**<  (VCI_INPUT_ENABLE) VCI Input Enable Register  Reset Value */

#define VCI_INPUT_ENABLE_IE_Pos               (0)                                            /**< (VCI_INPUT_ENABLE) Input Enables for VCI_IN# signals. After changing the input enable for a VCI input, firmware should reset the input latch and clear\n     any potential interrupt that may have been triggered by the input, as changing the enable may cause the internal status to change.\n     For each bit in the field:\n     1=Enabled. The corresponding VCI_IN# input is not gated and toggling the pin will affect the VCI_OUT pin\n     0=Not Enabled. the corresponding VCI_IN# input does not affect the VCI_OUT pin, even if the input is '0'. Unless the corresponding bit\n     in the VCI Buffer Enable Register is 1, latches are not asserted, even if the VCI_IN# pin is low, during a VBAT power transition Position */
#define VCI_INPUT_ENABLE_IE_Msk               (0xFU << VCI_INPUT_ENABLE_IE_Pos)              /**< (VCI_INPUT_ENABLE) Input Enables for VCI_IN# signals. After changing the input enable for a VCI input, firmware should reset the input latch and clear\n     any potential interrupt that may have been triggered by the input, as changing the enable may cause the internal status to change.\n     For each bit in the field:\n     1=Enabled. The corresponding VCI_IN# input is not gated and toggling the pin will affect the VCI_OUT pin\n     0=Not Enabled. the corresponding VCI_IN# input does not affect the VCI_OUT pin, even if the input is '0'. Unless the corresponding bit\n     in the VCI Buffer Enable Register is 1, latches are not asserted, even if the VCI_IN# pin is low, during a VBAT power transition Mask */
#define VCI_INPUT_ENABLE_IE(value)            (VCI_INPUT_ENABLE_IE_Msk & ((value) << VCI_INPUT_ENABLE_IE_Pos))
#define VCI_INPUT_ENABLE_Msk                  (0x0000000FUL)                                 /**< (VCI_INPUT_ENABLE) Register Mask  */

/* -------- VCI_HOLDOFF_COUNT : (VCI Offset: 0x10) (R/W 32) Holdoff Count Register -------- */

typedef union
{
  struct
  {
    uint32_t HOLDOFF_TIME:8;            /**< bit:   0..7  These bits determine the period of time the VCI_OUT logic is inhibited from re-asserting VCI_OUT after a SYS_SHDN# event.\n     FFh-01h=The Power On Inhibit Holdoff Time is set to a period between 125ms and 31.875 seconds.\n     0=The Power On Inhibit function is disabled. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_HOLDOFF_COUNT_bits_t;
#define VCI_HOLDOFF_COUNT_RESETVALUE        (0x00U)                                       /**<  (VCI_HOLDOFF_COUNT) Holdoff Count Register  Reset Value */

#define VCI_HOLDOFF_COUNT_HOLDOFF_TIME_Pos    (0)                                            /**< (VCI_HOLDOFF_COUNT) These bits determine the period of time the VCI_OUT logic is inhibited from re-asserting VCI_OUT after a SYS_SHDN# event.\n     FFh-01h=The Power On Inhibit Holdoff Time is set to a period between 125ms and 31.875 seconds.\n     0=The Power On Inhibit function is disabled. Position */
#define VCI_HOLDOFF_COUNT_HOLDOFF_TIME_Msk    (0xFFU << VCI_HOLDOFF_COUNT_HOLDOFF_TIME_Pos)  /**< (VCI_HOLDOFF_COUNT) These bits determine the period of time the VCI_OUT logic is inhibited from re-asserting VCI_OUT after a SYS_SHDN# event.\n     FFh-01h=The Power On Inhibit Holdoff Time is set to a period between 125ms and 31.875 seconds.\n     0=The Power On Inhibit function is disabled. Mask */
#define VCI_HOLDOFF_COUNT_HOLDOFF_TIME(value) (VCI_HOLDOFF_COUNT_HOLDOFF_TIME_Msk & ((value) << VCI_HOLDOFF_COUNT_HOLDOFF_TIME_Pos))
#define VCI_HOLDOFF_COUNT_Msk                 (0x000000FFUL)                                 /**< (VCI_HOLDOFF_COUNT) Register Mask  */

/* -------- VCI_POLARITY : (VCI Offset: 0x14) (R/W 32) VCI Polarity Register -------- */

typedef union
{
  struct
  {
    uint32_t VCI_IN_POL:4;              /**< bit:   0..3  These bits determine the polarity of the VCI_IN input signals: For each bit in the field:\n     1=Active High. The value on the pins is inverted before use\n     0=Active Low (default). */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_POLARITY_bits_t;
#define VCI_POLARITY_RESETVALUE             (0x00U)                                       /**<  (VCI_POLARITY) VCI Polarity Register  Reset Value */

