ranjithaguna/pv/LED_Demo/source/pic32cx/component/vci.h
#define VCI_POLARITY_VCI_IN_POL_Pos           (0)                                            /**< (VCI_POLARITY) These bits determine the polarity of the VCI_IN input signals: For each bit in the field:\n     1=Active High. The value on the pins is inverted before use\n     0=Active Low (default). Position */
#define VCI_POLARITY_VCI_IN_POL_Msk           (0xFU << VCI_POLARITY_VCI_IN_POL_Pos)          /**< (VCI_POLARITY) These bits determine the polarity of the VCI_IN input signals: For each bit in the field:\n     1=Active High. The value on the pins is inverted before use\n     0=Active Low (default). Mask */
#define VCI_POLARITY_VCI_IN_POL(value)        (VCI_POLARITY_VCI_IN_POL_Msk & ((value) << VCI_POLARITY_VCI_IN_POL_Pos))
#define VCI_POLARITY_Msk                      (0x0000000FUL)                                 /**< (VCI_POLARITY) Register Mask  */

/* -------- VCI_POSEDGE_DETECT : (VCI Offset: 0x18) (R/W 32) VCI Posedge Detect Register -------- */

typedef union
{
  struct
  {
    uint32_t VCI_IN_POS:4;              /**< bit:   0..3  These bits record a low to high transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Positive Edge Detected; 0=No edge detected. */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_POSEDGE_DETECT_bits_t;
#define VCI_POSEDGE_DETECT_RESETVALUE       (0x00U)                                       /**<  (VCI_POSEDGE_DETECT) VCI Posedge Detect Register  Reset Value */

#define VCI_POSEDGE_DETECT_VCI_IN_POS_Pos     (0)                                            /**< (VCI_POSEDGE_DETECT) These bits record a low to high transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Positive Edge Detected; 0=No edge detected. Position */
#define VCI_POSEDGE_DETECT_VCI_IN_POS_Msk     (0xFU << VCI_POSEDGE_DETECT_VCI_IN_POS_Pos)    /**< (VCI_POSEDGE_DETECT) These bits record a low to high transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Positive Edge Detected; 0=No edge detected. Mask */
#define VCI_POSEDGE_DETECT_VCI_IN_POS(value)  (VCI_POSEDGE_DETECT_VCI_IN_POS_Msk & ((value) << VCI_POSEDGE_DETECT_VCI_IN_POS_Pos))
#define VCI_POSEDGE_DETECT_Msk                (0x0000000FUL)                                 /**< (VCI_POSEDGE_DETECT) Register Mask  */

/* -------- VCI_NEGEDGE_DETECT : (VCI Offset: 0x1c) (R/W 32) VCI Negedge Detect Register -------- */

typedef union
{
  struct
  {
    uint32_t VCI_IN_NEG:4;              /**< bit:   0..3  These bits record a high to low transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Negative Edge Detected; 0=No edge detected. */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_NEGEDGE_DETECT_bits_t;
#define VCI_NEGEDGE_DETECT_RESETVALUE       (0x00U)                                       /**<  (VCI_NEGEDGE_DETECT) VCI Negedge Detect Register  Reset Value */

#define VCI_NEGEDGE_DETECT_VCI_IN_NEG_Pos     (0)                                            /**< (VCI_NEGEDGE_DETECT) These bits record a high to low transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Negative Edge Detected; 0=No edge detected. Position */
#define VCI_NEGEDGE_DETECT_VCI_IN_NEG_Msk     (0xFU << VCI_NEGEDGE_DETECT_VCI_IN_NEG_Pos)    /**< (VCI_NEGEDGE_DETECT) These bits record a high to low transition on the VCI_IN# pins. A 1 indicates a transition occurred. For each bit in the field:\n     1=Negative Edge Detected; 0=No edge detected. Mask */
#define VCI_NEGEDGE_DETECT_VCI_IN_NEG(value)  (VCI_NEGEDGE_DETECT_VCI_IN_NEG_Msk & ((value) << VCI_NEGEDGE_DETECT_VCI_IN_NEG_Pos))
#define VCI_NEGEDGE_DETECT_Msk                (0x0000000FUL)                                 /**< (VCI_NEGEDGE_DETECT) Register Mask  */

/* -------- VCI_BUFFER_ENABLE : (VCI Offset: 0x20) (R/W 32) VCI Buffer Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t VCI_BUFFER_EN:4;           /**< bit:   0..3  Input Buffer enable. After changing the buffer enable for a VCI input, firmware should reset the input latch and clear any\n     potential interrupt that may have been triggered by the input, as changing the buffer may cause the internal status to change. This register\n     has no effect when VTR is powered. When VTR is on, the input buffers are enabled only by the IE bit. For each bit in the field:\n     1=VCI_IN# input buffer enabled independent of the IE bit. The edge detection latches for this input are always enabled\n     0=VCI_IN# input buffer enabled by the IE bit. The edge detection latches are only enabled when the IE bit is 1 (default). */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __VCI_BUFFER_ENABLE_bits_t;
#define VCI_BUFFER_ENABLE_RESETVALUE        (0x00U)                                       /**<  (VCI_BUFFER_ENABLE) VCI Buffer Enable Register  Reset Value */

#define VCI_BUFFER_ENABLE_VCI_BUFFER_EN_Pos   (0)                                            /**< (VCI_BUFFER_ENABLE) Input Buffer enable. After changing the buffer enable for a VCI input, firmware should reset the input latch and clear any\n     potential interrupt that may have been triggered by the input, as changing the buffer may cause the internal status to change. This register\n     has no effect when VTR is powered. When VTR is on, the input buffers are enabled only by the IE bit. For each bit in the field:\n     1=VCI_IN# input buffer enabled independent of the IE bit. The edge detection latches for this input are always enabled\n     0=VCI_IN# input buffer enabled by the IE bit. The edge detection latches are only enabled when the IE bit is 1 (default). Position */
#define VCI_BUFFER_ENABLE_VCI_BUFFER_EN_Msk   (0xFU << VCI_BUFFER_ENABLE_VCI_BUFFER_EN_Pos)  /**< (VCI_BUFFER_ENABLE) Input Buffer enable. After changing the buffer enable for a VCI input, firmware should reset the input latch and clear any\n     potential interrupt that may have been triggered by the input, as changing the buffer may cause the internal status to change. This register\n     has no effect when VTR is powered. When VTR is on, the input buffers are enabled only by the IE bit. For each bit in the field:\n     1=VCI_IN# input buffer enabled independent of the IE bit. The edge detection latches for this input are always enabled\n     0=VCI_IN# input buffer enabled by the IE bit. The edge detection latches are only enabled when the IE bit is 1 (default). Mask */
#define VCI_BUFFER_ENABLE_VCI_BUFFER_EN(value) (VCI_BUFFER_ENABLE_VCI_BUFFER_EN_Msk & ((value) << VCI_BUFFER_ENABLE_VCI_BUFFER_EN_Pos))
#define VCI_BUFFER_ENABLE_Msk                 (0x0000000FUL)                                 /**< (VCI_BUFFER_ENABLE) Register Mask  */

/** \brief VCI register offsets definitions */
#define VCI_REG_OFFSET               (0x00)         /**< (VCI_REG) VCI Register Offset */
#define VCI_LATCH_ENABLE_OFFSET      (0x04)         /**< (VCI_LATCH_ENABLE) Latch Enable Register Offset */
#define VCI_LATCH_RESETS_OFFSET      (0x08)         /**< (VCI_LATCH_RESETS) Latch Resets Register Offset */
#define VCI_INPUT_ENABLE_OFFSET      (0x0C)         /**< (VCI_INPUT_ENABLE) VCI Input Enable Register Offset */
#define VCI_HOLDOFF_COUNT_OFFSET     (0x10)         /**< (VCI_HOLDOFF_COUNT) Holdoff Count Register Offset */
#define VCI_POLARITY_OFFSET          (0x14)         /**< (VCI_POLARITY) VCI Polarity Register Offset */
#define VCI_POSEDGE_DETECT_OFFSET    (0x18)         /**< (VCI_POSEDGE_DETECT) VCI Posedge Detect Register Offset */
#define VCI_NEGEDGE_DETECT_OFFSET    (0x1C)         /**< (VCI_NEGEDGE_DETECT) VCI Negedge Detect Register Offset */
#define VCI_BUFFER_ENABLE_OFFSET     (0x20)         /**< (VCI_BUFFER_ENABLE) VCI Buffer Enable Register Offset */

/** \brief VCI register API structure */
typedef struct
{  /* The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */
  __IO  __VCI_REG_bits_t               VCI_REG;       /**< Offset: 0x00 (R/W  32) VCI Register */
  __IO  __VCI_LATCH_ENABLE_bits_t      LATCH_ENABLE;  /**< Offset: 0x04 (R/W  32) Latch Enable Register */
  __IO  __VCI_LATCH_RESETS_bits_t      LATCH_RESETS;  /**< Offset: 0x08 (R/W  32) Latch Resets Register */
  __IO  __VCI_INPUT_ENABLE_bits_t      VCI_INPUT_ENABLE; /**< Offset: 0x0C (R/W  32) VCI Input Enable Register */
  __IO  __VCI_HOLDOFF_COUNT_bits_t     HOLDOFF_COUNT; /**< Offset: 0x10 (R/W  32) Holdoff Count Register */
  __IO  __VCI_POLARITY_bits_t          VCI_POLARITY;  /**< Offset: 0x14 (R/W  32) VCI Polarity Register */
  __IO  __VCI_POSEDGE_DETECT_bits_t    VCI_POSEDGE_DETECT; /**< Offset: 0x18 (R/W  32) VCI Posedge Detect Register */
  __IO  __VCI_NEGEDGE_DETECT_bits_t    VCI_NEGEDGE_DETECT; /**< Offset: 0x1C (R/W  32) VCI Negedge Detect Register */
  __IO  __VCI_BUFFER_ENABLE_bits_t     VCI_BUFFER_ENABLE; /**< Offset: 0x20 (R/W  32) VCI Buffer Enable Register */
} vci_registers_t;
/** @}  end of The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */

#endif /* _PIC32CX_0525SG12_VCI_COMPONENT_H_ */
